<?php
/* 삼향연산자: 비교연산자와 함께 사용하여 어떤 판단을 하고자 할 때 사용
 * $변수명 = (조건식) ? 값1:값2;
 * 값1은 조건식이 참일 경우 변수에 할당되는 값, 거짓이면 값2
 * ? 와 : 을 사용해서 사용한다.
 */

$age = 19;
$age_adult = 20;
$check_adult=($age_adult>=$age) ?"성년자 ":"미성년자";

print $check_adult."<br/>";

// 오류제어연산자 (예외처리) PHP코드가 오류가 있을때, 오류메세지를 무시하도록 하는 연산자.
// php 코드 앞에 @ 을 붙여서 사용한다. 

$a = [1,2,3];
print @$a[3]; // 미표시


// 실행연산자:  php를 실행하고 있는 os의 명령을  실행하기 위한 연산자
// ``

$list = `dir`;
print "<pre>";
print $list;
print"</pre>";

// 증감연산자 같은 수를 더하거나 빼거나 할때 사용 ++,--
// ++$cnt 사전증가, $cnt++ 사후증가
$cnt = 0;
print $cnt++."<br/>";
print $cnt."<br/>";
print ++$cnt."<br/>";
?>
