<?php
/* 변수의 유효 범위 (Scope): 특정변수를 사용할 수 있는 구간을 의미한다.
 *규칙
 *1.슈퍼글로벌변수 스크립트 전체에서 사용할 수 있다. 
 *2.선언된 상수: 스크립트 전역에서 사용할 수 있다.
 *3. 전역변수: 스크립트 내에서 정의된 변수로서 스크립트 내에서 사용할 수 있으나,
 * 함수 안에서는 사용할 수 없다.
 *4.함수 안에서 정의된 변수: 함수내에서만 사용
 *5.함수안에서 전역으로 정의된 함수 함수 밖에서는 사용할 수 없다.
 * 매번ㄴ사용시마다 값이 저장되어 있어서 다음에 사용할 수 있다.
 *6. 함수 안에서 사용된 변수: 함수가 끝나면 내용 삭제
 */

//1. 슈퍼 글로벌 변수 
//$GLOBALS: 모든 전역변수의 배열 
//$_SERVER:  서버환경변수의 배열 
//$_ENV 환경변수의 배열
//$_COOKIE: 쿠키변수의 배열 
//$_ GET: get 메소드로 넘어온 변수의 배열
//$_POST: POST 메소드로 넘어온 변수의 배열 
//$_FILES: 파일의 업로드와 관련된 변수의 배열
//$_REQUEST: 사용자가 입력한 변수의 배열 
//$_SESSION: 세션 변수의 배열

$test = 100; // 전역변수

function test(){
//    $test = 500;
    global $test; // global 키워드를 사용하여 함수 밖의 변수를 참조
    print $test."</br>";
}

print $test."</br>";
test();

$data = 1;
function scopeTest(){
    $GLOBALS['data'] += 1 ;
    print $GLOBALS['data'];
    print "</br>";
}
print $data."</br>";
scopeTest();

?>
