<?php
   /*
    * 변수(variable)  변할 수 있는 값
    * 메모리와 관련이 있음
    * 계산결과(숫자)나 메세지(문자열)를 보관해둘 수 있음
    * 필요할때는 공간의 이름을 참조해서 사용할 수 있음
    * 상수는 실행 중에 변하지 않지만 변수는 변할 수 있음
    */

   /*  변수명 규칙
    * 변수 앞에 반드시! $를 붙임 ex) $a
    * 알파벳 숫자 사용가능 대소문자 구분 가능
    * 숫자가 맨 앞에는 올 수 없다.$7a(X) $_23(O)
    * 사용가능: a-z|A-Z|0-9|_
    * $this  예약어는 사용할 수 없다.
    */
   /* 대입연산자
    * A=100 A에 100 할당
    * "="은 할당 연산자
    * 
    */
$text= "데이터";
print $text;
print "<br>";

$text = 100;
print $text;
print "<br/>";

$A = 120;
$B = 100;
$C = $A + $B;
print $C;        

?>